<a href="https://colab.research.google.com/github/Ihalhu/IPWeek3Ihalhu/blob/main/Moringa_Data_Science_Prep_W3_Independent_Project_2019_07_Halima_I__Hussein_Python_notebook_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Let's first load the sql extension into our environment
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
# Let's now connect to our in memory sqlite database
%sql sqlite://

'Connected: @None'

In [ ]:
# Let's import the pandas in order to load our dataset into the environment
#
import pandas as pd 
import numpy as np

In [ ]:
#Let's now load our dataset into our environment
#Let's first load the description file to understand our dataset
df_cellDescr = pd.read_excel('cells_geo_description.xlsx')
df_cellDescr

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [ ]:
# Lets now load the CDR desrciption file
cdr_decript = pd.read_excel('CDR_description.xlsx')
cdr_decript

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [ ]:
# Let's now load our cell geo data set and remove the delimiter for the dataset to be easy to read
# Replacing All NaN with Zero;
df_cell = pd.read_csv('cells_geo.csv',delimiter=',')
df_cell.head(5)

  ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE
0  0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
1  1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
2  2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
3  3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
4  4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...

In [ ]:
#Let's clean our data
#Data Selection from Cell_geo.csv
df_cell.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3974 entries, 0 to 3973
Data columns (total 1 columns):
 #   Column                                                                                            Non-Null Count  Dtype
---  ------                                                                                            --------------  -----
 0   ;villes;status;localisation;decoupzone;zonename;longitude;latitude;region;area;cell_id;site_code  3974 non-null   object
dtypes: object(1)
memory usage: 31.2+ KB

In [ ]:
#Let's load our Telcom dataset below
# Loading the first telcom Dataset and cleaning any naming errors therein
telco = pd.read_csv('Telcom_dataset.csv')
telco.rename(columns={'PRODUTC':'PRODUCT'},inplace=True)
telco

     PRODUCT  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0      Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2        sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms    100  2012-05-07 00:01:54.0  ...     OTHER  0c2371d9bc  1e751d08a4
4997   Voice      1  2012-05-07 00:01:54.0  ...     19e2e  5fb791cf56  65efe2bc62
4998   Voice      0  2012-05-07 00:01:54.0  ...     19e2e  7773627c12  9ef9616350
4999   Voice      0  2012-05-07 00:01:54.0  ...     19e2e  3f4af49d6c  969b8d0e39
5000   Voice      7  2012-05-07 00:01:54.0  ...     19e2e  6f4d9b77a5  ebfc58af70

[5001 rows x 10 columns]

In [ ]:
#Let's now commence cleaning data in the telco dataset
telco.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          5001 non-null   object
 1   VALUE            5001 non-null   int64
 2   DATETIME         5001 non-null   object
 3   CELL_ON_SITE     5001 non-null   object
 4   DW_A_NUMBER_INT  5001 non-null   object
 5   DW_B_NUMBER_INT  5001 non-null   object
 6   COUNTRY_A        5001 non-null   object
 7   COUNTRY_B        5001 non-null   object
 8   CELL_ID          5001 non-null   object
 9   SITE_ID          4285 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

In [ ]:
#Let's rename and check for any missing values
# Let's rename and lower the columns
telco.columns = map(str.lower, telco.columns)

telco.head(5)

  product  value               datetime  ... country_b     cell_id     site_id
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
# Let's now drop the unnecessary columns
telco.drop(['dw_a_number_int','dw_b_number_int','country_a','country_b','cell_id','site_id'],axis=1,inplace=True)

In [ ]:
telco.head(20)

   product  value               datetime cell_on_site
0    Voice      0  2012-05-06 23:04:37.0            1
1      sms      0  2012-05-06 23:05:25.0            0
2      sms     25  2012-05-06 23:05:41.0            0
3    Voice     56  2012-05-06 23:05:42.0            1
4    Voice     14  2012-05-06 23:06:29.0            1
5     data      0  2012-05-06 23:07:26.0            _
6    Voice      0  2012-05-06 23:08:02.0            1
7    Voice      0  2012-05-06 23:08:03.0            5
8    Voice      0  2012-05-06 23:08:05.0            1
9      sms      0  2012-05-06 23:08:43.0            0
10     sms      0  2012-05-06 23:08:50.0            2
11     sms      0  2012-05-06 23:09:12.0            2
12     sms      0  2012-05-06 23:09:13.0            1
13     sms     25  2012-05-06 23:09:16.0            1
14   Voice      0  2012-05-06 23:09:26.0            1
15   Voice      0  2012-05-06 23:09:51.0            0
16   Voice     44  2012-05-06 23:09:54.0            2
17   Voice      0  2012-05-06 23:09:59.0            2
18     sms      0  2012-05-06 23:10:05.0            0
19   Voice     14  2012-05-06 23:10:23.0            1

In [ ]:
# Let's now check for null values
telco.isnull()

      product  value  datetime  cell_on_site
0       False  False     False         False
1       False  False     False         False
2       False  False     False         False
3       False  False     False         False
4       False  False     False         False
...       ...    ...       ...           ...
4996    False  False     False         False
4997    False  False     False         False
4998    False  False     False         False
4999    False  False     False         False
5000    False  False     False         False

[5001 rows x 4 columns]

In [ ]:
#Let's load our Telcom dataset2 below
with open('Telcom_dataset2.csv','r') as f:
    Telcom_dataset2 = pd.read_csv(f, index_col=0, encoding='utf-8') 

# Save the Telcom dataset2 into a database
%sql DROP TABLE if EXISTS Telcom_dataset2;
%sql PERSIST Telcom_dataset2;
# Checking if our dataset2 has been saved into the database
# Display the first 5 entries from the database
%sql SELECT * FROM Telcom_dataset2 LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[('sms', 0, '2012-05-07 23:02:06.0', '2', '32255675c3b6fe3', '1aa7ae01386e9fb', '19e2e', '19e2e', '+854AcBQT2', '+854AcBQT2'),
 ('Voice', 0, '2012-05-07 23:03:44.0', '1', 'ff16d6ac74c1c64', '87d87309c15a8c9', '19e2e', '19e2e', '+854AcBQT2', '+854AcBQT2'),
 ('sms', 0, '2012-05-07 23:04:06.0', '0', '98d9f2fb5ff624b', '93343ba6e41af95', '19e2e', '19e2e', '+laSrk7g6q', '+laSrk7g6q'),
 ('Voice', 37, '2012-05-07 23:04:48.0', '1', '3f9c8a33ec7be1f', '7d05a38f89c49d8', '19e2e', '19e2e', '/xvRrCVKoQ', '/xvRrCVKoQ'),
 ('sms', 25, '2012-05-07 23:04:58.0', '1', '7bcccc03adf3864', '56a5d5430d2fa86', '19e2e', '19e2e', '+bO+qkSonO', '+bO+qkSonO')]

In [ ]:
#Let's load our Telcom dataset3 below
with open('Telcom_dataset3.csv','r') as f:
    Telcom_dataset3 = pd.read_csv(f, index_col=0, encoding='utf-8') 

# Save the Telcom dataset3 into a database
%sql DROP TABLE if EXISTS Telcom_dataset3;
%sql PERSIST Telcom_dataset3;
# Checking if our dataset has been saved into the database
# Display the first 5 entries from the database
%sql SELECT * FROM Telcom_dataset3 LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[('Voice', 61, '2012-05-08 23:01:28.0', '2', '966f68353622feb', 'ffd53a3bb2db6f1', '19e2e', '19e2e', '+38u2u/rfx', '+38u2u/rfx'),
 ('sms', 0, '2012-05-08 23:01:31.0', '1', 'a0a597384c612d7', 'cf3b218f1dde792', '19e2e', '19e2e', '+Fs4mTvdKx', '+Fs4mTvdKx'),
 ('Voice', 10, '2012-05-08 23:02:59.0', '1', '5441a9a58c97132', '52f8b299515b9b7', '19e2e', '19e2e', '+ZaaZozy/+', '+ZaaZozy/+'),
 ('sms', 0, '2012-05-08 23:03:04.0', '0', '8ab8b9ed6989f61', 'e09e736e46c5c3d', '19e2e', '19e2e', '+cNeJzsTp3', '+cNeJzsTp3'),
 ('Voice', 22, '2012-05-08 23:03:16.0', '4', '52662a62b199334', '2186273faab4602', '19e2e', '19e2e', '/eeMklgyJA', '/eeMklgyJA')]

In [ ]:
# Let's replace the VILLE column Name with Cities
df_cell.rename(columns={'VILLES':'Cities'},inplace=True)
df_cell.reset_index(drop=True)

     ;VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE
0     0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
1     1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
2     2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
3     3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
4     4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
...                                                 ...
3969  3969;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3970  3970;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3971  3971;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3972  3972;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3973  3973;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...

[3974 rows x 1 columns]

In [ ]:
# Let's now convert the column names into lower case for ease of reading
df_cell.columns = map(str.lower, df_cell.columns)
df_cell

     ;villes;status;localisation;decoupzone;zonename;longitude;latitude;region;area;cell_id;site_code
0     0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
1     1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
2     2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AG...
3     3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
4     4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSI...
...                                                 ...
3969  3969;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3970  3970;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3971  3971;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3972  3972;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...
3973  3973;ZUENOULA;In Service;INTERIEUR;Grand-NORD;...

[3974 rows x 1 columns]

In [ ]:
# Let's now check the null values
df_cell.isnull().head(5)

   ;villes;status;localisation;decoupzone;zonename;longitude;latitude;region;area;cell_id;site_code
0                                              False
1                                              False
2                                              False
3                                              False
4                                              False

In [ ]:
# Let's now replace the Null values in the status columns as offline
df_cell['status'].fillna('Offline',inplace=True)
df_cell

KeyError: ignored

In [ ]:
# Let's now replace the Null values in the Area columns as Unknown
df_cell['area'].fillna('unknown',inplace=True)
df_cell

NameError: ignored

In [ ]:
df_cell.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3974 entries, 0 to 3973
Data columns (total 1 columns):
 #   Column                                                                                            Non-Null Count  Dtype
---  ------                                                                                            --------------  -----
 0   ;villes;status;localisation;decoupzone;zonename;longitude;latitude;region;area;cell_id;site_code  3974 non-null   object
dtypes: object(1)
memory usage: 31.2+ KB

In [ ]:
telco_new = telco.copy(deep=True)
telco_new

     product  value               datetime cell_on_site
0      Voice      0  2012-05-06 23:04:37.0            1
1        sms      0  2012-05-06 23:05:25.0            0
2        sms     25  2012-05-06 23:05:41.0            0
3      Voice     56  2012-05-06 23:05:42.0            1
4      Voice     14  2012-05-06 23:06:29.0            1
...      ...    ...                    ...          ...
4996     sms    100  2012-05-07 00:01:54.0            0
4997   Voice      1  2012-05-07 00:01:54.0            1
4998   Voice      0  2012-05-07 00:01:54.0            1
4999   Voice      0  2012-05-07 00:01:54.0            0
5000   Voice      7  2012-05-07 00:01:54.0            2

[5001 rows x 4 columns]

In [ ]:
telco_len = telco.shape[0]
telco_len

5001

In [ ]:
#Let's now find out the most used city
#
df_cell['cities'].value_counts()

KeyError: ignored

In [ ]:
#Let's now find out which business or home hours were most used
telco.head(10)

  product  value               datetime cell_on_site
0   Voice      0  2012-05-06 23:04:37.0            1
1     sms      0  2012-05-06 23:05:25.0            0
2     sms     25  2012-05-06 23:05:41.0            0
3   Voice     56  2012-05-06 23:05:42.0            1
4   Voice     14  2012-05-06 23:06:29.0            1
5    data      0  2012-05-06 23:07:26.0            _
6   Voice      0  2012-05-06 23:08:02.0            1
7   Voice      0  2012-05-06 23:08:03.0            5
8   Voice      0  2012-05-06 23:08:05.0            1
9     sms      0  2012-05-06 23:08:43.0            0

In [ ]:
#Let's now find out the busiest(most used) and the slowest times(least used), as well as the most prevalent date therein in general
telco['datetime'].value_counts()

2012-05-07 00:00:10.0    71
2012-05-07 00:00:05.0    61
2012-05-07 00:00:06.0    60
2012-05-07 00:01:41.0    53
2012-05-07 00:00:07.0    52
                         ..
2012-05-06 23:58:08.0     1
2012-05-06 23:49:59.0     1
2012-05-06 23:36:27.0     1
2012-05-06 23:37:35.0     1
2012-05-06 23:31:17.0     1
Name: datetime, Length: 708, dtype: int64